<!DOCTYPE html>
<html>
<!-- Created by GNU Texinfo 7.1, https://www.gnu.org/software/texinfo/ -->
<head>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8">
<!-- Copyright © 1988-2025 Free Software Foundation, Inc.

Permission is granted to copy, distribute and/or modify this document
under the terms of the GNU Free Documentation License, Version 1.3 or
any later version published by the Free Software Foundation; with the
Invariant Sections being "Free Software" and "Free Software Needs
Free Documentation", with the Front-Cover Texts being "A GNU Manual,"
and with the Back-Cover Texts as in (a) below.

(a) The FSF's Back-Cover Text is: "You are free to copy and modify
this GNU Manual.  Buying copies from GNU Press supports the FSF in
developing GNU and promoting software freedom." -->
<title>Symbols (Debugging with GDB)</title>

<meta name="description" content="Symbols (Debugging with GDB)">
<meta name="keywords" content="Symbols (Debugging with GDB)">
<meta name="resource-type" content="document">
<meta name="distribution" content="global">
<meta name="Generator" content="makeinfo">
<meta name="viewport" content="width=device-width,initial-scale=1">

<link href="index.html" rel="start" title="Top">
<link href="Concept-Index.html" rel="index" title="Concept Index">
<link href="index.html#SEC_Contents" rel="contents" title="Table of Contents">
<link href="index.html" rel="up" title="Top">
<link href="Altering.html" rel="next" title="Altering">

Unrolling means that <code class="code">whatis</code> will show the underlying type used
in the <code class="code">typedef</code> declaration of <var class="var">arg</var>.  However, if that
underlying type is also a <code class="code">typedef</code>, <code class="code">whatis</code> will not
unroll it.
</p>
<p>For C code, the type names may also have the form &lsquo;<samp class="samp">class
<var class="var">class-name</var></samp>&rsquo;, &lsquo;<samp class="samp">struct <var class="var">struct-tag</var></samp>&rsquo;, &lsquo;<samp class="samp">union
<var class="var">union-tag</var></samp>&rsquo; or &lsquo;<samp class="samp">enum <var class="var">enum-tag</var></samp>&rsquo;.
</p>
<p><var class="var">flags</var> can be used to modify how the type is displayed.
Available flags are:
</p>
<dl class="table">
<dt><code class="code">r</code></dt>
<dd><p>Display in &ldquo;raw&rdquo; form.  Normally, <small class="sc">GDB</small> substitutes template
parameters and typedefs defined in a class when printing the class&rsquo;
members.  The <code class="code">/r</code> flag disables this.
</p>
</dd>
<dt><code class="code">m</code></dt>
<dd><p>Do not print methods defined in the class.
</p>
</dd>
<dt><code class="code">M</code></dt>
<dd><p>Print methods defined in the class.  This is the default, but the flag
exists in case you change the default with <code class="command">set print type methods</code>.
</p>
</dd>
<dt><code class="code">t</code></dt>
<dd><p>Do not print typedefs defined in the class.  Note that this controls
whether the typedef definition itself is printed, not whether typedef
names are substituted when printing other types.
</p>
</dd>
<dt><code class="code">T</code></dt>
<dd><p>Print typedefs defined in the class.  This is the default, but the flag
exists in case you change the default with <code class="command">set print type typedefs</code>.
</p>
</dd>
<dt><code class="code">o</code></dt>
<dd><p>Print the offsets and sizes of fields in a struct, similar to what the
<code class="command">pahole</code> tool does.  This option implies the <code class="code">/tm</code> flags.
</p>
</dd>
<dt><code class="code">x</code></dt>
<dd><p>Use hexadecimal notation when printing offsets and sizes of fields in a
struct.
</p>
</dd>
<dt><code class="code">d</code></dt>
<dd><p>Use decimal notation when printing offsets and sizes of fields in a
struct.
</p>
<p>For example, given the following declarations:
</p>
<div class="example smallexample">
<pre class="example-preformatted">struct tuv
{
  int a1;
  char *a2;
  int a3;
};

struct xyz
{
  int f1;
  char f2;
  void *f3;
  struct tuv f4;
};

union qwe
{
  struct tuv fff1;
  struct xyz fff2;
};

struct tyu
{
  int a1 : 1;
  int a2 : 3;
  int a3 : 23;
  char a4 : 2;
  int64_t a5;
  int a6 : 5;
  int64_t a7 : 3;
};
</pre></div>

<p>Issuing a <kbd class="kbd">ptype /o struct tuv</kbd> command would print:
</p>
<div class="example smallexample">
<pre class="example-preformatted">(gdb) ptype /o struct tuv
/* offset      |    size */  type = struct tuv {
/*      0      |       4 */    int a1;
/* XXX  4-byte hole      */
/*      8      |       8 */    char *a2;
/*     16      |       4 */    int a3;

                               /* total size (bytes):   24 */
                             }
</pre></div>

<p>Notice the format of the first column of comments.  There, you can
find two parts separated by the &lsquo;<samp class="samp">|</samp>&rsquo; character: the <em class="emph">offset</em>,
which indicates where the field is located inside the struct, in
bytes, and the <em class="emph">size</em> of the field.  Another interesting line is
the marker of a <em class="emph">hole</em> in the struct, indicating that it may be
possible to pack the struct and make it use less space by reorganizing
its fields.
</p>
<p>It is also possible to print offsets inside an union:
</p>
<div class="example smallexample">
<pre class="example-preformatted">(gdb) ptype /o union qwe
/* offset      |    size */  type = union qwe {
/*                    24 */    struct tuv {
/*      0      |       4 */        int a1;
/* XXX  4-byte hole      */
/*      8      |       8 */        char *a2;
/*     16      |       4 */        int a3;

                                   /* total size (bytes):   24 */
                               } fff1;
/*                    40 */    struct xyz {
/*      0      |       4 */        int f1;
/*      4      |       1 */        char f2;
/* XXX  3-byte hole      */
/*      8      |       8 */        void *f3;
/*     16      |      24 */        struct tuv {
/*     16      |       4 */            int a1;
/* XXX  4-byte hole      */
/*     24      |       8 */            char *a2;
/*     32      |       4 */            int a3;

                                       /* total size (bytes):   24 */
                                   } f4;

                                   /* total size (bytes):   40 */
                               } fff2;

                               /* total size (bytes):   40 */
                             }
</pre></div>

<p>In this case, since <code class="code">struct tuv</code> and <code class="code">struct xyz</code> occupy the
same space (because we are dealing with an union), the offset is not
printed for them.  However, you can still examine the offset of each
of these structures&rsquo; fields.
</p>
<p>Another useful scenario is printing the offsets of a struct containing
bitfields:
</p>
<div class="example smallexample">
<pre class="example-preformatted">(gdb) ptype /o struct tyu
/* offset      |    size */  type = struct tyu {
/*      0:31   |       4 */    int a1 : 1;
/*      0:28   |       4 */    int a2 : 3;
/*      0: 5   |       4 */    int a3 : 23;
/*      3: 3   |       1 */    signed char a4 : 2;
/* XXX  3-bit hole       */
/* XXX  4-byte hole      */
/*      8      |       8 */    int64_t a5;
/*     16: 0   |       4 */    int a6 : 5;
/*     16: 5   |       8 */    int64_t a7 : 3;
/* XXX  7-byte padding   */

                               /* total size (bytes):   24 */
                             }
</pre></div>

<p>Note how the offset information is now extended to also include the
first bit of the bitfield.
</p></dd>
</dl>

</dd>
<dt><a id="index-ptype"></a><span><code class="code">ptype[/<var class="var">flags</var>] [<var class="var">arg</var>]</code><a class="copiable-link" href="#index-ptype"> &para;</a></span></dt>
<dd><p><code class="code">ptype</code> accepts the same arguments as <code class="code">whatis</code>, but prints a
detailed description of the type, instead of just the name of the type.
See <a class="xref" href="Expressions.html">Expressions</a>.
</p>
<p>Contrary to <code class="code">whatis</code>, <code class="code">ptype</code> always unrolls any
<code class="code">typedef</code>s in its argument declaration, whether the argument is
